
let demoList = {
    status: 200,
    message: 'success',
    data: {
        "message": "first",
        "showHeader": false,
        "unread": [{
            "date": "2018-04-19 20:00:00",
            "title": "【系统通知】该系统将于今晚凌晨2点到5点进行升级维护"
        },{
            "date": "2018-04-19 20:00:00",
            "title": "今晚12点整发大红包，先到先得"
        },{
            "date": "2020-08-12 18:28:00",
            "title": "你在事业上碰到的挫折，有打退堂鼓的动机时，你就应加以留着，这是最危险的时候！————乔布斯"
        },{
            "date": "2020-12-28 21:00:00",
            "title": "职场不是走秀场，而是斗兽场，比的不是谁更厉害，而是谁能生存下去，能活的久"
        },{
            "date": "2018-04-19 20:00:00",
            "title": "如果事情结束了，哪就是结束了别回头冲着你下一个目标去吧"
        },{
            "date": "2018-12-28 21:00:00",
            "title": "生活的字典里最重要的三个词，就是意志工作等待"
        },{
            "date": "2020-08-12 18:28:00",
            "title": "琴瑟松弛，弹不出动听的乐曲；生活散漫，点不燃性命的火焰"
        },{
            "date": "2020-12-28 21:00:00",
            "title": "自卑是自己的影子，当我们头顶一轮自信的太阳，自卑就在我们的脚下荡然无存。"
        }],
        "read": [{
            "date": "2018-04-19 20:00:00",
            "title": "古今庸人，败于情字，古今才人，败于傲字"
        }],
        "recycle": [{
            "date": "2018-04-19 20:00:00",
            "title": "把你的聪颖与睿智用于创造，你将前程无量！"
        }]
    }
};

export default {
    //'get|/parameter/query': demoList,
    // 也可以这样写
    // 官方解释为：记录用于生成响应数据的函数。当拦截到匹配 rurl 和 rtype 的 Ajax 请求时，函数 function(options) 将被执行，并把执行结果作为响应数据返回。
    'get|/parameter/tabsList': (option) => {
        // 可以在这个地方对demoList2进行一系列操作，例如增删改
        // option 指向本次请求的 Ajax 选项集，含有 url、type 和 body 三个属性
        return {
            status: 200,
            message: 'success',
            data: demoList
        };
    }
}
